# libraries

In [1]:
# import pyyaml module
import yaml
from yaml.loader import SafeLoader
import os
from tqdm import tqdm
import pandas as pd
from yaml import safe_load
import time
import pandas_profiling as pp
import pickle

# # data extarction

In [273]:
os.listdir()
os.chdir("t20s")

In [275]:
file=os.listdir()

In [276]:
z=time.time()
count=1
df=pd.DataFrame()
for y in tqdm(file):
    with open(y,"r") as f:
        df1 = pd.json_normalize(safe_load(f))
        df1.insert(0,"match",count)          
        df=df.append(df1)
        count=count+1

y=time.time()
print(y-z)
df

100%|██████████████████████████████████████████████████████████████████████████████| 1431/1431 [15:16<00:00,  1.56it/s]

916.0087356567383

,match,innings,meta.data_version,meta.created,meta.revision,info.dates,info.gender,info.match_type,info.outcome.by.wickets,info.outcome.winner,...,info.outcome.by.runs,info.match_type_number,info.neutral_venue,info.outcome.method,info.outcome.result,info.outcome.eliminator,info.supersubs.New Zealand,info.supersubs.South Africa,info.bowl_out,info.outcome.bowl_out
0,1,"[{'1st innings': {'team': 'Australia', 'delive...",0.9,2017-02-18,2,[2017-02-17],male,T20,5.0,Sri Lanka,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,2,"[{'1st innings': {'team': 'Australia', 'delive...",0.9,2017-02-19,2,[2017-02-19],male,T20,2.0,Sri Lanka,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,3,"[{'1st innings': {'team': 'Australia', 'delive...",0.9,2017-02-23,1,[2017-02-22],male,T20,NaN,Australia,...,41.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,4,"[{'1st innings': {'team': 'Hong Kong', 'delive...",0.9,2016-09-12,1,[2016-09-05],male,T20,NaN,Hong Kong,...,40.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,5,"[{'1st innings': {'team': 'Zimbabwe', 'deliver...",0.9,2016-06-19,1,[2016-06-18],male,T20,NaN,Zimbabwe,...,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
0,1427,"[{'1st innings': {'team': 'Sri Lanka', 'delive...",0.9,2016-03-05,2,[2016-03-04],male,T20,6.0,Pakistan,...,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,1428,"[{'1st innings': {'team': 'Bangladesh', 'deliv...",0.9,2016-03-08,1,[2016-03-06],male,T20,8.0,India,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,1429,"[{'1st innings': {'team': 'Netherlands', 'deli...",0.9,2016-02-03,1,[2016-02-03],male,T20,NaN,Netherlands,...,84.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,1430,"[{'1st innings': {'team': 'Australia', 'delive...",0.9,2016-09-12,1,[2016-09-06],male,T20,NaN,Australia,...,85.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,1431,"[{'1st innings': {'team': 'Sri Lanka', 'delive...",0.9,2016-09-12,1,[2016-09-09],male,T20,4.0,Australia,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# data backup and info

In [277]:
copy=df.copy()
copy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1431 entries, 0 to 0
Data columns (total 28 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   match                        1431 non-null   int64
 1   innings                      1431 non-null   object
 2   meta.data_version            1431 non-null   float64
 3   meta.created                 1431 non-null   object
 4   meta.revision                1431 non-null   int64
 5   info.dates                   1431 non-null   object
 6   info.gender                  1431 non-null   object
 7   info.match_type              1431 non-null   object
 8   info.outcome.by.wickets      661 non-null    float64
 9   info.outcome.winner          1385 non-null   object
 10  info.overs                   1431 non-null   int64
 11  info.player_of_match         1268 non-null   object
 12  info.teams                   1431 non-null   object
 13  info.toss.decision           1431 non-null   object
 14  info.toss.winner             1431 non-null   object
 15  info.umpires                 1409 non-null   object
 16  info.venue                   1431 non-null   object
 17  info.city                    1239 non-null   object
 18  info.outcome.by.runs         724 non-null    float64
 19  info.match_type_number       698 non-null    float64
 20  info.neutral_venue           328 non-null    float64
 21  info.outcome.method          51 non-null     object
 22  info.outcome.result          46 non-null     object
 23  info.outcome.eliminator      16 non-null     object
 24  info.supersubs.New Zealand   1 non-null      object
 25  info.supersubs.South Africa  1 non-null      object
 26  info.bowl_out                2 non-null      object
 27  info.outcome.bowl_out        2 non-null      object
dtypes: float64(5), int64(3), object(20)
memory usage: 324.2+ KB

# save data into pickle

In [278]:
model_filename = "data1.pkl"

saved_model = pickle.dump(df, open(model_filename,'wb'))

In [281]:
os.getcwd()

'C:\\Users\\devel\\Downloads\\machine_learning\\PROJECT ON GIT\\t20matchscoreprector\\t20s'

# load data

In [282]:

df2 = pd.read_pickle(r'data1.pkl')

In [283]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1431 entries, 0 to 0
Data columns (total 28 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   match                        1431 non-null   int64
 1   innings                      1431 non-null   object
 2   meta.data_version            1431 non-null   float64
 3   meta.created                 1431 non-null   object
 4   meta.revision                1431 non-null   int64
 5   info.dates                   1431 non-null   object
 6   info.gender                  1431 non-null   object
 7   info.match_type              1431 non-null   object
 8   info.outcome.by.wickets      661 non-null    float64
 9   info.outcome.winner          1385 non-null   object
 10  info.overs                   1431 non-null   int64
 11  info.player_of_match         1268 non-null   object
 12  info.teams                   1431 non-null   object
 13  info.toss.decision           1431 non-null   object
 14  info.toss.winner             1431 non-null   object
 15  info.umpires                 1409 non-null   object
 16  info.venue                   1431 non-null   object
 17  info.city                    1239 non-null   object
 18  info.outcome.by.runs         724 non-null    float64
 19  info.match_type_number       698 non-null    float64
 20  info.neutral_venue           328 non-null    float64
 21  info.outcome.method          51 non-null     object
 22  info.outcome.result          46 non-null     object
 23  info.outcome.eliminator      16 non-null     object
 24  info.supersubs.New Zealand   1 non-null      object
 25  info.supersubs.South Africa  1 non-null      object
 26  info.bowl_out                2 non-null      object
 27  info.outcome.bowl_out        2 non-null      object
dtypes: float64(5), int64(3), object(20)
memory usage: 324.2+ KB

## droping colums

In [284]:
dfnew=df2.drop(['meta.data_version', 'meta.created',
       'meta.revision', 'info.dates','info.outcome.by.runs', 'info.match_type_number', 'info.neutral_venue',
       'info.outcome.method', 'info.outcome.result', 'info.outcome.eliminator',
       'info.supersubs.New Zealand', 'info.supersubs.South Africa',
       'info.bowl_out', 'info.outcome.bowl_out'
       ],axis=1)

In [285]:
dfnew.head(2)

,match,innings,info.gender,info.match_type,info.outcome.by.wickets,info.outcome.winner,info.overs,info.player_of_match,info.teams,info.toss.decision,info.toss.winner,info.umpires,info.venue,info.city
0,1,"[{'1st innings': {'team': 'Australia', 'delive...",male,T20,5.0,Sri Lanka,20,[DAS Gunaratne],"[Australia, Sri Lanka]",field,Sri Lanka,"[MD Martell, P Wilson]",Melbourne Cricket Ground,NaN
0,2,"[{'1st innings': {'team': 'Australia', 'delive...",male,T20,2.0,Sri Lanka,20,[DAS Gunaratne],"[Australia, Sri Lanka]",field,Sri Lanka,"[SD Fry, SJ Nogajski]","Simonds Stadium, South Geelong",Victoria

## feature engineerging

### gender column

In [286]:
dfnew["info.gender"].value_counts()

male      965
female    466
Name: info.gender, dtype: int64

In [287]:
dfnew=dfnew[dfnew["info.gender"]=="male"]

###  over column

In [288]:
print(dfnew["info.overs"].value_counts())
dfnew=dfnew[dfnew["info.overs"]==20]

20    962
50      3
Name: info.overs, dtype: int64

In [289]:
type(dfnew[dfnew["match"]==1]["innings"][0])

list

In [290]:
dfnew.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 962 entries, 0 to 0
Data columns (total 14 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   match                    962 non-null    int64
 1   innings                  962 non-null    object
 2   info.gender              962 non-null    object
 3   info.match_type          962 non-null    object
 4   info.outcome.by.wickets  443 non-null    float64
 5   info.outcome.winner      926 non-null    object
 6   info.overs               962 non-null    int64
 7   info.player_of_match     864 non-null    object
 8   info.teams               962 non-null    object
 9   info.toss.decision       962 non-null    object
 10  info.toss.winner         962 non-null    object
 11  info.umpires             952 non-null    object
 12  info.venue               962 non-null    object
 13  info.city                824 non-null    object
dtypes: float64(1), int64(2), object(11)
memory usage: 112.7+ KB

### city column

In [291]:
import numpy as np
dfnew["info.city"]=np.where(dfnew["info.city"].isnull(),dfnew["info.venue"].str.split(" ").apply(lambda x:x[0]),dfnew["info.city"])

In [292]:
dfnew[dfnew["match"]==5]["info.city"]

0    Harare
Name: info.city, dtype: object

### extracting data from ininings.info

In [293]:

teams=[]
new={}
su=1
ball=[]
runs=[]
wickets=[]
count1=[]
batsman=[]
bowler=[]
bowlingteam=[]
city=[]
for i in tqdm(dfnew["match"]):
    try:
        bowlingte=list(dfnew[dfnew["match"]==i]["info.teams"])[0]
        z=dfnew[dfnew["match"]==i]["innings"][0][0]["1st innings"]["team"]
        wicket=0
        su=su+1
        ballcount=1
        z1=len(dfnew[dfnew["match"]==i]["innings"][0][0]["1st innings"]['deliveries'])
        for u in range(z1):
            #count=dfnew[dfnew["match"]==i]["innings"][0][0]["1st innings"]['deliveries'][u][0.1]["runs"]['total']
            run=list(dfnew[dfnew["match"]==i]["innings"][0][0]["1st innings"]['deliveries'][u].values())[0]["runs"]["total"]
            bt=list(dfnew[dfnew["match"]==i]["innings"][0][0]["1st innings"]['deliveries'][u].values())[0]["batsman"]
            bw=list(dfnew[dfnew["match"]==i]["innings"][0][0]["1st innings"]['deliveries'][u].values())[0]["bowler"]
            zlist=list(dfnew[dfnew["match"]==i]["innings"][0][0]["1st innings"]['deliveries'][u].values())[0].keys()
            #df[dfnew["match"]==i]dfnew["info.city"]
            city1=dfnew[dfnew["match"]==i]["info.city"][0]
            if "wicket"  in zlist:
                wicket=wicket+1
            ball.append(ballcount)
            ballcount=ballcount+1
            teams.append(z)
            count1.append(su)
            runs.append(run)
            wickets.append(wicket)
            bowler.append(bw)
            batsman.append(bt)
            bowlingteam.append(bowlingte)
            city.append(city1)
        ballcount=1
        wicket=0
    except Exception as e:
        pass

new["battingteams"]=teams
new["match"]=count1
new["run"]=runs
new["ball_count"]=ball
new["wickets"]=wickets
new["batsman"]=batsman
new["bowler"]=bowler
new["city"]=city
new["bowlingteam"]=bowlingteam
new=pd.DataFrame(new)
new=new.set_index("match")

100%|████████████████████████████████████████████████████████████████████████████████| 962/962 [09:09<00:00,  1.75it/s]

### saving csv file

In [4]:
final1=new.to_csv("final.csv")

NameError: name 'new' is not defined

In [6]:

new=pd.read_csv("final.csv")

In [7]:
new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 116424 entries, 0 to 116423
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   match         116424 non-null  int64
 1   battingteams  116424 non-null  object
 2   run           116424 non-null  int64
 3   ball_count    116424 non-null  int64
 4   wickets       116424 non-null  int64
 5   batsman       116424 non-null  object
 6   bowler        116424 non-null  object
 7   city          116424 non-null  object
 8   bowlingteam   116424 non-null  object
dtypes: int64(4), object(5)
memory usage: 8.0+ MB

In [297]:
new.describe()

               match            run     ball_count        wickets
count  116424.000000  116424.000000  116424.000000  116424.000000
mean      481.885359       1.262317      61.701969       2.674182
std       277.484559       1.552781      35.694970       2.174463
min         2.000000       0.000000       1.000000       0.000000
25%       243.000000       0.000000      31.000000       1.000000
50%       481.000000       1.000000      61.000000       2.000000
75%       723.000000       1.000000      92.000000       4.000000
max       963.000000       7.000000     134.000000      10.000000

In [298]:
new.sample(15)

,match,battingteams,run,ball_count,wickets,batsman,bowler,city,bowlingteam
94074,778,Netherlands,1,39,4,TLW Cooper,N M'shangwe,Sylhet,"['Netherlands', 'Zimbabwe']"
87932,728,West Indies,1,6,0,LMP Simmons,CB Mpofu,Antigua,"['West Indies', 'Zimbabwe']"
77975,644,Ireland,1,32,2,NJ O'Brien,GJ Maxwell,Colombo,"['Australia', 'Ireland']"
38690,322,Papua New Guinea,2,79,1,TP Ura,C Viljoen,Dubai,"['Namibia', 'Papua New Guinea']"
12418,103,Bangladesh,4,88,4,Mahmudullah,V Shankar,Colombo,"['Bangladesh', 'India']"
57328,474,New Zealand,4,83,4,JDP Oram,A Nel,Durban,"['South Africa', 'New Zealand']"
37352,311,Sri Lanka,2,100,4,MD Shanaka,Shadab Khan,Lahore,"['Pakistan', 'Sri Lanka']"
31482,263,Singapore,1,25,1,TH David,S Lamichhane,Singapore,"['Singapore', 'Nepal']"
12251,102,Sri Lanka,1,46,4,BMAJ Mendis,Mahmudullah,Colombo,"['Sri Lanka', 'Bangladesh']"
24395,203,Nigeria,2,120,8,CM Akachukwu,A Rangaswamy,Kampala,"['Botswana', 'Nigeria']"
113434,939,Zimbabwe,4,44,1,H Masakadza,Arafat Sunny,Khulna,"['Bangladesh', 'Zimbabwe']"
21662,180,Oman,4,33,1,Jatinder Singh,FJ Klaassen,Al Amarat,"['Oman', 'Netherlands']"
26802,224,Australia,4,27,0,AJ Finch,L Ngidi,Cape Town,"['South Africa', 'Australia']"
18356,152,New Zealand,1,59,4,LRPL Taylor,KH Pandya,Auckland,"['New Zealand', 'India']"
75927,627,Zimbabwe,1,75,1,H Masakadza,RJ Nicol,Hamilton,"['New Zealand', 'Zimbabwe']"

In [8]:

new["bowlingteam"].value_counts()

['Australia', 'Pakistan']       2183
['New Zealand', 'Pakistan']     2101
['Afghanistan', 'Ireland']      2068
['England', 'Pakistan']         1949
['Australia', 'India']          1943
                                ...
['Nepal', 'Ireland']              90
['Botswana', 'Namibia']           78
['Oman', 'Nepal']                 68
['Netherlands', 'Sri Lanka']      63
['New Zealand', 'Scotland']       42
Name: bowlingteam, Length: 299, dtype: int64

### find out bowling team

In [9]:

new["bowlingteam"]=new["bowlingteam"].str.split("'")

In [10]:
count=0
for i in tqdm(new["match"]):
    z=new["battingteams"][count]
    if z==new["bowlingteam"][count][1]:
        new["bowlingteam"][count]=new["bowlingteam"][count][3]
    elif z==new["bowlingteam"][count][3]:
        new["bowlingteam"][count]=new["bowlingteam"][count][1]
    count=count+1

  0%|                                                                                       | 0/116424 [00:00<?, ?it/s]<ipython-input-10-ad26cf66c330>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new["bowlingteam"][count]=new["bowlingteam"][count][3]
  0%|▏                                                                           | 359/116424 [00:00<03:48, 508.29it/s]<ipython-input-10-ad26cf66c330>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new["bowlingteam"][count]=new["bowlingteam"][count][1]
100%|█████████████████████████████████████████████████████████████████████████| 116424/116424 [03:53<00:00, 498.10it/s]

In [11]:
new["bowlingteam"].value_counts()

Pakistan                    8993
Australia                   8975
India                       8217
England                     8155
West Indies                 7809
New Zealand                 7783
Sri Lanka                   6916
South Africa                6160
Bangladesh                  6113
Ireland                     5586
Zimbabwe                    4614
Afghanistan                 4008
Scotland                    3721
Netherlands                 3698
Hong Kong                   2879
United Arab Emirates        2355
Nepal                       1992
Oman                        1987
Kenya                       1600
Canada                      1351
Papua New Guinea             993
Malaysia                     985
Namibia                      942
Bermuda                      746
Spain                        630
Botswana                     621
United States of America     618
Qatar                        606
ICC World XI                 498
Singapore                    493
Germany                      491
Maldives                     472
Guernsey                     440
Vanuatu                      415
Philippines                  383
Kuwait                       381
Italy                        368
Uganda                       368
Portugal                     261
Bahrain                      253
Ghana                        251
Norway                       249
Jersey                       248
Nigeria                      247
Denmark                      247
Thailand                     246
Luxembourg                   246
Romania                      222
Cayman Islands               125
Czech Republic               125
Bhutan                       125
Saudi Arabia                 116
Bulgaria                     101
Name: bowlingteam, dtype: int64

### retaining popular teams

In [12]:
import numpy as np
new=new[new["battingteams"]!=new["bowlingteam"]]

In [13]:
new["bowlingteam"].value_counts()

Pakistan                    8993
Australia                   8975
India                       8217
England                     8155
West Indies                 7809
New Zealand                 7783
Sri Lanka                   6916
South Africa                6160
Bangladesh                  6113
Ireland                     5586
Zimbabwe                    4614
Afghanistan                 4008
Scotland                    3721
Netherlands                 3698
Hong Kong                   2879
United Arab Emirates        2355
Nepal                       1992
Oman                        1987
Kenya                       1600
Canada                      1351
Papua New Guinea             993
Malaysia                     985
Namibia                      942
Bermuda                      746
Spain                        630
Botswana                     621
United States of America     618
Qatar                        606
ICC World XI                 498
Singapore                    493
Germany                      491
Maldives                     472
Guernsey                     440
Vanuatu                      415
Philippines                  383
Kuwait                       381
Italy                        368
Uganda                       368
Portugal                     261
Bahrain                      253
Ghana                        251
Norway                       249
Jersey                       248
Nigeria                      247
Denmark                      247
Thailand                     246
Luxembourg                   246
Romania                      222
Cayman Islands               125
Czech Republic               125
Bhutan                       125
Saudi Arabia                 116
Bulgaria                     101
Name: bowlingteam, dtype: int64

In [14]:
new["battingteams"].unique()

array(['Australia', 'Hong Kong', 'Zimbabwe', 'India', 'Bangladesh',
       'New Zealand', 'South Africa', 'England', 'West Indies', 'Ireland',
       'Afghanistan', 'Pakistan', 'United Arab Emirates', 'Scotland',
       'Oman', 'Papua New Guinea', 'Sri Lanka', 'Netherlands', 'Nepal',
       'Vanuatu', 'Philippines', 'United States of America', 'Germany',
       'Ghana', 'Uganda', 'Kenya', 'Namibia', 'Nigeria', 'Botswana',
       'Guernsey', 'Denmark', 'Jersey', 'Italy', 'Norway', 'Thailand',
       'Malaysia', 'Maldives', 'Singapore', 'Kuwait', 'Bermuda', 'Canada',
       'Cayman Islands', 'Portugal', 'Gibraltar', 'Spain', 'Bhutan',
       'Qatar', 'Iran', 'Belgium', 'Isle of Man', 'Bulgaria', 'Romania'],
      dtype=object)

In [15]:
teams=['Australia','Zimbabwe', 'India', 'Bangladesh',
       'New Zealand', 'South Africa', 'England', 'West Indies', 'Ireland',
       'Afghanistan', 'Pakistan',"Sri Lanka"]

In [16]:
new=new[new["battingteams"].isin(teams)]

In [17]:
new["battingteams"].value_counts()

Pakistan        10339
South Africa     8434
India            8382
New Zealand      8357
Sri Lanka        8057
West Indies      7243
Australia        6984
England          6967
Afghanistan      5206
Bangladesh       4881
Ireland          4661
Zimbabwe         4361
Name: battingteams, dtype: int64

In [18]:

new["bowlingteam"].unique()

array(['Sri Lanka', 'India', 'Zimbabwe', 'New Zealand', 'Bangladesh',
       'England', 'South Africa', 'Afghanistan', 'Ireland', 'Pakistan',
       'West Indies', 'United Arab Emirates', 'Australia', 'Scotland',
       'ICC World XI', 'Netherlands', 'Oman', 'Hong Kong', 'Nepal',
       'Namibia', 'Kenya', 'Canada', 'Papua New Guinea'], dtype=object)

In [19]:
new=new[new["bowlingteam"].isin(teams)]

In [21]:

new.info()
new.to_csv("new.csv")

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76547 entries, 0 to 116423
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   match         76547 non-null  int64
 1   battingteams  76547 non-null  object
 2   run           76547 non-null  int64
 3   ball_count    76547 non-null  int64
 4   wickets       76547 non-null  int64
 5   batsman       76547 non-null  object
 6   bowler        76547 non-null  object
 7   city          76547 non-null  object
 8   bowlingteam   76547 non-null  object
dtypes: int64(4), object(5)
memory usage: 5.8+ MB

In [61]:
new=pd.read_csv("new.csv")

### copy file

In [62]:
new2=new.copy()
new.head(2)

,Unnamed: 0,match,battingteams,run,ball_count,wickets,batsman,bowler,city,bowlingteam
0,0,2,Australia,0,1,0,AJ Finch,SL Malinga,Melbourne,Sri Lanka
1,1,2,Australia,0,2,0,AJ Finch,SL Malinga,Melbourne,Sri Lanka

### finding total in a match

In [63]:
z=new.groupby('match').sum()['run'].reset_index()
new = new.merge(z,on='match')

### finding current score

In [64]:
new['current_score'] = new.groupby('match').cumsum()['run_x']

In [65]:
new.sample(12)
new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76547 entries, 0 to 76546
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     76547 non-null  int64
 1   match          76547 non-null  int64
 2   battingteams   76547 non-null  object
 3   run_x          76547 non-null  int64
 4   ball_count     76547 non-null  int64
 5   wickets        76547 non-null  int64
 6   batsman        76547 non-null  object
 7   bowler         76547 non-null  object
 8   city           76547 non-null  object
 9   bowlingteam    76547 non-null  object
 10  run_y          76547 non-null  int64
 11  current_score  76547 non-null  int64
dtypes: int64(7), object(5)
memory usage: 7.6+ MB

### finding wicket left

###

In [66]:
new['wickets_left'] = 10 - new['wickets']

In [67]:
new

,Unnamed: 0,match,battingteams,run_x,ball_count,wickets,batsman,bowler,city,bowlingteam,run_y,current_score,wickets_left
0,0,2,Australia,0,1,0,AJ Finch,SL Malinga,Melbourne,Sri Lanka,168,0,10
1,1,2,Australia,0,2,0,AJ Finch,SL Malinga,Melbourne,Sri Lanka,168,0,10
2,2,2,Australia,1,3,0,AJ Finch,SL Malinga,Melbourne,Sri Lanka,168,1,10
3,3,2,Australia,2,4,0,M Klinger,SL Malinga,Melbourne,Sri Lanka,168,3,10
4,4,2,Australia,0,5,0,M Klinger,SL Malinga,Melbourne,Sri Lanka,168,3,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...
76542,116419,963,Sri Lanka,1,122,8,SMSM Senanayake,MA Starc,Colombo,Australia,128,125,2
76543,116420,963,Sri Lanka,0,123,8,DM de Silva,MA Starc,Colombo,Australia,128,125,2
76544,116421,963,Sri Lanka,0,124,9,DM de Silva,MA Starc,Colombo,Australia,128,125,1
76545,116422,963,Sri Lanka,2,125,9,SMSM Senanayake,MA Starc,Colombo,Australia,128,127,1
76546,116423,963,Sri Lanka,1,126,9,SMSM Senanayake,MA Starc,Colombo,Australia,128,128,1

In [68]:
new['crr'] = round((new['current_score']*6)/new['ball_count'],2)

In [69]:
new.sample(2)

,Unnamed: 0,match,battingteams,run_x,ball_count,wickets,batsman,bowler,city,bowlingteam,run_y,current_score,wickets_left,crr
64054,97770,808,Pakistan,1,77,2,Mohammad Hafeez,JP Duminy,Cape Town,South Africa,176,97,8,7.56
38759,66498,550,Australia,1,111,9,SW Tait,Umar Gul,Melbourne,Pakistan,127,126,1,6.81

### finding current run rate

In [70]:
new['balls_left'] = 120 - new['ball_count']
new['balls_left'] = new['balls_left'].apply(lambda x:0 if x<0 else x)

In [71]:
new['crr'] = round((new['current_score']*6)/new['ball_count'],2)

### taking important columns

In [72]:
final_df = new[['match','battingteams','bowlingteam','run_x','current_score','ball_count','wickets_left','crr','city','run_y']]

In [73]:
final_df

,match,battingteams,bowlingteam,run_x,current_score,ball_count,wickets_left,crr,city,run_y
0,2,Australia,Sri Lanka,0,0,1,10,0.00,Melbourne,168
1,2,Australia,Sri Lanka,0,0,2,10,0.00,Melbourne,168
2,2,Australia,Sri Lanka,1,1,3,10,2.00,Melbourne,168
3,2,Australia,Sri Lanka,2,3,4,10,4.50,Melbourne,168
4,2,Australia,Sri Lanka,0,3,5,10,3.60,Melbourne,168
...,...,...,...,...,...,...,...,...,...,...
76542,963,Sri Lanka,Australia,1,125,122,2,6.15,Colombo,128
76543,963,Sri Lanka,Australia,0,125,123,2,6.10,Colombo,128
76544,963,Sri Lanka,Australia,0,125,124,1,6.05,Colombo,128
76545,963,Sri Lanka,Australia,2,127,125,1,6.10,Colombo,128
76546,963,Sri Lanka,Australia,1,128,126,1,6.10,Colombo,128

### counting last five overs score and removing nan values

In [74]:
groups = final_df.groupby('match')

In [75]:
match_ids = final_df['match'].unique()
last_five = []
for id in match_ids:
    last_five.extend(groups.get_group(id).rolling(window=30).sum()['run_x'].values.tolist())

In [76]:
final_df['last_five'] = last_five

<ipython-input-76-0fbf01c1d1e3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_df['last_five'] = last_five

In [77]:
final_df.dropna(inplace=True)

<ipython-input-77-3665e38311c9>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_df.dropna(inplace=True)

### removing cities which less value than 600

In [78]:
eligible_cities = final_df['city'].value_counts()[final_df['city'].value_counts() > 600].index.tolist()
final_df = final_df[final_df['city'].isin(eligible_cities)]

### saving csv final file

In [8]:
final_df.sample(6)

,Unnamed: 0,match,battingteams,bowlingteam,run_x,current_score,ball_count,wickets_left,crr,city,run_y,last_five
4602,10923,121,Pakistan,Zimbabwe,0,120,90,6,8.00,Harare,182,42.0
27840,53783,690,West Indies,New Zealand,1,78,71,9,6.59,Lauderhill,209,34.0
22125,45189,608,Pakistan,South Africa,0,37,42,6,5.29,Abu Dhabi,120,28.0
14602,31914,485,Australia,India,1,61,44,8,8.32,Mumbai,166,44.0
28415,55264,704,New Zealand,South Africa,2,53,63,4,5.05,Durban,86,34.0
35394,67534,838,Zimbabwe,Pakistan,3,73,58,9,7.55,Lahore,175,35.0

In [22]:
final_df=final_df.drop(columns=["Unnamed: 0"])

In [15]:
final_df=final_df.set_index("match")

In [39]:
final_df.to_csv("cleaned_.csv")

In [23]:
final_df

,battingteams,bowlingteam,run_x,current_score,ball_count,wickets_left,crr,city,run_y,last_five
match,,,,,,,,,,
2,Australia,Sri Lanka,1,43,30,10,8.60,Melbourne,168,43.0
2,Australia,Sri Lanka,1,44,31,10,8.52,Melbourne,168,44.0
2,Australia,Sri Lanka,1,45,32,10,8.44,Melbourne,168,45.0
2,Australia,Sri Lanka,0,45,33,10,8.18,Melbourne,168,44.0
2,Australia,Sri Lanka,0,45,34,10,7.94,Melbourne,168,42.0
...,...,...,...,...,...,...,...,...,...,...
963,Sri Lanka,Australia,1,125,122,2,6.15,Colombo,128,32.0
963,Sri Lanka,Australia,0,125,123,2,6.10,Colombo,128,32.0
963,Sri Lanka,Australia,0,125,124,1,6.05,Colombo,128,32.0
963,Sri Lanka,Australia,2,127,125,1,6.10,Colombo,128,33.0
963,Sri Lanka,Australia,1,128,126,1,6.10,Colombo,128,32.0

In [4]:
final_df=pd.read_csv("cleaned_.csv")

### train test spilt

In [25]:

X = final_df.drop(columns=['run_x','run_y'])
y = final_df['run_y']
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=1)

In [26]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31829 entries, 733 to 805
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   battingteams   31829 non-null  object
 1   bowlingteam    31829 non-null  object
 2   current_score  31829 non-null  int64
 3   ball_count     31829 non-null  int64
 4   wickets_left   31829 non-null  int64
 5   crr            31829 non-null  float64
 6   city           31829 non-null  object
 7   last_five      31829 non-null  float64
dtypes: float64(2), int64(3), object(3)
memory usage: 2.2+ MB

### feature engineering and model buliding

In [ ]:
pip install xgboost

In [27]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.pipeline import Pipeline,make_pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.ensemble import RandomForestRegressor
from xgboost import XGBRegressor
from sklearn.metrics import r2_score,mean_absolute_error

In [28]:
X_train.columns

Index(['battingteams', 'bowlingteam', 'current_score', 'ball_count',
       'wickets_left', 'crr', 'city', 'last_five'],
      dtype='object')

## making pipeline and column transformer

In [29]:
# one hot encoding
trf1 = ColumnTransformer([("one",OneHotEncoder(sparse=False,handle_unknown='ignore'),[0,1,6])],remainder='passthrough')
# Scaling
trf2 = ColumnTransformer([("standardsclar",StandardScaler(),[2,3,4,5,7])],remainder='passthrough')
# the model
trf3 = XGBRegressor(n_estimators=1000,learning_rate=0.2,max_depth=12,random_state=1)

In [30]:
pipe=make_pipeline(trf1,trf2,trf3)

In [31]:
import time
z=time.time()
pipe.fit(X_train,y_train)
y=time.time()
ti=y-z

In [32]:
y_pred = pipe.predict(X_test)
print(r2_score(y_test,y_pred))
print(mean_absolute_error(y_test,y_pred))

0.9901555119608199
1.559177592340562

In [33]:
pipe.predict(X_test.iloc[0:1])

array([184.29092], dtype=float32)

In [34]:
X_test.iloc[0:1]

,battingteams,bowlingteam,current_score,ball_count,wickets_left,crr,city,last_five
match,,,,,,,,
769,Sri Lanka,England,65,46,8,8.48,London,41.0

In [35]:
import joblib

model_filename = "finalmodel"

saved_model = joblib.dump(pipe, open(model_filename,'wb'))

In [36]:
import joblib
z=joblib.load("finalmodel","w+")

In [37]:
z.predict(X_test.iloc[0:1])

array([184.29092], dtype=float32)

In [58]:
z

           0
0  Australia
1   srilanka
2         67
3         45
4          8
5       8.67
6  Melbourne
7         43

In [38]:
input_df = pd.DataFrame(
        {'battingteam': ["Australia"], 'bowlingteam': ["srilanka"],'current_score': [97],
         'ball_count':[45],'wickets_left': [7], 'crr': [8.67],"city":["Melbourne"] ,'last_five': [43]})
result = z.predict(input_df)

C:\Users\devel\anaconda3\lib\site-packages\sklearn\compose\_column_transformer.py:437: FutureWarning: Given feature/column names or counts do not match the ones for the data given during fit. This will fail from v0.24.
  warnings.warn("Given feature/column names or counts do not match "

In [39]:
result

array([170.49414], dtype=float32)

In [108]:
import xgboost
xgboost.__version__

'1.5.2'

In [44]:
python --version

NameError: name 'python' is not defined

In [45]:
import sys
print(sys.version)

3.8.5 (default, Sep  3 2020, 21:29:08) [MSC v.1916 64 bit (AMD64)]

In [47]:
import numpy
numpy.__version__

'1.19.2'